SOAP/Fedex Sample code/Fedex Sample code/Advance/FDX_WS_AdvancedServices_PHP_v2014/WS_AdvanvedServicesWSDLs_v2014/CloseService_WSDL/CloseTransactions/Ground CloseRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/close/v3">
   <SOAP-ENV:Body>
      <GroundCloseRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key>Input Your Information</Key>
             <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
            <IntegratorId>String</IntegratorId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>EN</LocaleCode>
            </Localization>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>GroundCloseRequest_v3</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>clos</ServiceId>
            <Major>3</Major>
            <Intermediate>1</Intermediate>
            <Minor>0</Minor>
         </Version>
         <TimeUpToWhichShipmentsAreToBeClosed>2014-06-18T11:30:47-05:00</TimeUpToWhichShipmentsAreToBeClosed>
      </GroundCloseRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>